podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- FGPIOA_PDOR                              ------ */
#define GPIO_PDOR_PDO0_MASK                      (0x01UL << GPIO_PDOR_PDO0_SHIFT)                    /*!< FGPIOA_PDOR: PDO0 Mask                  */
#define GPIO_PDOR_PDO0_SHIFT                     0                                                   /*!< FGPIOA_PDOR: PDO0 Position              */
#define GPIO_PDOR_PDO1_MASK                      (0x01UL << GPIO_PDOR_PDO1_SHIFT)                    /*!< FGPIOA_PDOR: PDO1 Mask                  */
#define GPIO_PDOR_PDO1_SHIFT                     1                                                   /*!< FGPIOA_PDOR: PDO1 Position              */
#define GPIO_PDOR_PDO2_MASK                      (0x01UL << GPIO_PDOR_PDO2_SHIFT)                    /*!< FGPIOA_PDOR: PDO2 Mask                  */
#define GPIO_PDOR_PDO2_SHIFT                     2                                                   /*!< FGPIOA_PDOR: PDO2 Position              */
#define GPIO_PDOR_PDO3_MASK                      (0x01UL << GPIO_PDOR_PDO3_SHIFT)                    /*!< FGPIOA_PDOR: PDO3 Mask                  */
#define GPIO_PDOR_PDO3_SHIFT                     3                                                   /*!< FGPIOA_PDOR: PDO3 Position              */
#define GPIO_PDOR_PDO4_MASK                      (0x01UL << GPIO_PDOR_PDO4_SHIFT)                    /*!< FGPIOA_PDOR: PDO4 Mask                  */
#define GPIO_PDOR_PDO4_SHIFT                     4                                                   /*!< FGPIOA_PDOR: PDO4 Position              */
#define GPIO_PDOR_PDO5_MASK                      (0x01UL << GPIO_PDOR_PDO5_SHIFT)                    /*!< FGPIOA_PDOR: PDO5 Mask                  */
#define GPIO_PDOR_PDO5_SHIFT                     5                                                   /*!< FGPIOA_PDOR: PDO5 Position              */
#define GPIO_PDOR_PDO6_MASK                      (0x01UL << GPIO_PDOR_PDO6_SHIFT)                    /*!< FGPIOA_PDOR: PDO6 Mask                  */
#define GPIO_PDOR_PDO6_SHIFT                     6                                                   /*!< FGPIOA_PDOR: PDO6 Position              */
#define GPIO_PDOR_PDO7_MASK                      (0x01UL << GPIO_PDOR_PDO7_SHIFT)                    /*!< FGPIOA_PDOR: PDO7 Mask                  */
#define GPIO_PDOR_PDO7_SHIFT                     7                                                   /*!< FGPIOA_PDOR: PDO7 Position              */
#define GPIO_PDOR_PDO8_MASK                      (0x01UL << GPIO_PDOR_PDO8_SHIFT)                    /*!< FGPIOA_PDOR: PDO8 Mask                  */
#define GPIO_PDOR_PDO8_SHIFT                     8                                                   /*!< FGPIOA_PDOR: PDO8 Position              */
#define GPIO_PDOR_PDO9_MASK                      (0x01UL << GPIO_PDOR_PDO9_SHIFT)                    /*!< FGPIOA_PDOR: PDO9 Mask                  */
#define GPIO_PDOR_PDO9_SHIFT                     9                                                   /*!< FGPIOA_PDOR: PDO9 Position              */
#define GPIO_PDOR_PDO10_MASK                     (0x01UL << GPIO_PDOR_PDO10_SHIFT)                   /*!< FGPIOA_PDOR: PDO10 Mask                 */
#define GPIO_PDOR_PDO10_SHIFT                    10                                                  /*!< FGPIOA_PDOR: PDO10 Position             */
#define GPIO_PDOR_PDO11_MASK                     (0x01UL << GPIO_PDOR_PDO11_SHIFT)                   /*!< FGPIOA_PDOR: PDO11 Mask                 */
#define GPIO_PDOR_PDO11_SHIFT                    11                                                  /*!< FGPIOA_PDOR: PDO11 Position             */
#define GPIO_PDOR_PDO12_MASK                     (0x01UL << GPIO_PDOR_PDO12_SHIFT)                   /*!< FGPIOA_PDOR: PDO12 Mask                 */
#define GPIO_PDOR_PDO12_SHIFT                    12                                                  /*!< FGPIOA_PDOR: PDO12 Position             */
#define GPIO_PDOR_PDO13_MASK                     (0x01UL << GPIO_PDOR_PDO13_SHIFT)                   /*!< FGPIOA_PDOR: PDO13 Mask                 */
#define GPIO_PDOR_PDO13_SHIFT                    13                                                  /*!< FGPIOA_PDOR: PDO13 Position             */
#define GPIO_PDOR_PDO14_MASK                     (0x01UL << GPIO_PDOR_PDO14_SHIFT)                   /*!< FGPIOA_PDOR: PDO14 Mask                 */
#define GPIO_PDOR_PDO14_SHIFT                    14                                                  /*!< FGPIOA_PDOR: PDO14 Position             */
#define GPIO_PDOR_PDO15_MASK                     (0x01UL << GPIO_PDOR_PDO15_SHIFT)                   /*!< FGPIOA_PDOR: PDO15 Mask                 */
#define GPIO_PDOR_PDO15_SHIFT                    15                                                  /*!< FGPIOA_PDOR: PDO15 Position             */
#define GPIO_PDOR_PDO16_MASK                     (0x01UL << GPIO_PDOR_PDO16_SHIFT)                   /*!< FGPIOA_PDOR: PDO16 Mask                 */
#define GPIO_PDOR_PDO16_SHIFT                    16                                                  /*!< FGPIOA_PDOR: PDO16 Position             */
#define GPIO_PDOR_PDO17_MASK                     (0x01UL << GPIO_PDOR_PDO17_SHIFT)                   /*!< FGPIOA_PDOR: PDO17 Mask                 */
#define GPIO_PDOR_PDO17_SHIFT                    17                                                  /*!< FGPIOA_PDOR: PDO17 Position             */
#define GPIO_PDOR_PDO18_MASK                     (0x01UL << GPIO_PDOR_PDO18_SHIFT)                   /*!< FGPIOA_PDOR: PDO18 Mask                 */
#define GPIO_PDOR_PDO18_SHIFT                    18                                                  /*!< FGPIOA_PDOR: PDO18 Position             */
#define GPIO_PDOR_PDO19_MASK                     (0x01UL << GPIO_PDOR_PDO19_SHIFT)                   /*!< FGPIOA_PDOR: PDO19 Mask                 */
#define GPIO_PDOR_PDO19_SHIFT                    19                                                  /*!< FGPIOA_PDOR: PDO19 Position             */
#define GPIO_PDOR_PDO20_MASK                     (0x01UL << GPIO_PDOR_PDO20_SHIFT)                   /*!< FGPIOA_PDOR: PDO20 Mask                 */
#define GPIO_PDOR_PDO20_SHIFT                    20                                                  /*!< FGPIOA_PDOR: PDO20 Position             */
#define GPIO_PDOR_PDO21_MASK                     (0x01UL << GPIO_PDOR_PDO21_SHIFT)                   /*!< FGPIOA_PDOR: PDO21 Mask                 */
#define GPIO_PDOR_PDO21_SHIFT                    21                                                  /*!< FGPIOA_PDOR: PDO21 Position             */
#define GPIO_PDOR_PDO22_MASK                     (0x01UL << GPIO_PDOR_PDO22_SHIFT)                   /*!< FGPIOA_PDOR: PDO22 Mask                 */
#define GPIO_PDOR_PDO22_SHIFT                    22                                                  /*!< FGPIOA_PDOR: PDO22 Position             */
#define GPIO_PDOR_PDO23_MASK                     (0x01UL << GPIO_PDOR_PDO23_SHIFT)                   /*!< FGPIOA_PDOR: PDO23 Mask                 */
#define GPIO_PDOR_PDO23_SHIFT                    23                                                  /*!< FGPIOA_PDOR: PDO23 Position             */
#define GPIO_PDOR_PDO24_MASK                     (0x01UL << GPIO_PDOR_PDO24_SHIFT)                   /*!< FGPIOA_PDOR: PDO24 Mask                 */
#define GPIO_PDOR_PDO24_SHIFT                    24                                                  /*!< FGPIOA_PDOR: PDO24 Position             */
#define GPIO_PDOR_PDO25_MASK                     (0x01UL << GPIO_PDOR_PDO25_SHIFT)                   /*!< FGPIOA_PDOR: PDO25 Mask                 */
#define GPIO_PDOR_PDO25_SHIFT                    25                                                  /*!< FGPIOA_PDOR: PDO25 Position             */
#define GPIO_PDOR_PDO26_MASK                     (0x01UL << GPIO_PDOR_PDO26_SHIFT)                   /*!< FGPIOA_PDOR: PDO26 Mask                 */
#define GPIO_PDOR_PDO26_SHIFT                    26                                                  /*!< FGPIOA_PDOR: PDO26 Position             */
#define GPIO_PDOR_PDO27_MASK                     (0x01UL << GPIO_PDOR_PDO27_SHIFT)                   /*!< FGPIOA_PDOR: PDO27 Mask                 */
#define GPIO_PDOR_PDO27_SHIFT                    27                                                  /*!< FGPIOA_PDOR: PDO27 Position             */
#define GPIO_PDOR_PDO28_MASK                     (0x01UL << GPIO_PDOR_PDO28_SHIFT)                   /*!< FGPIOA_PDOR: PDO28 Mask                 */
#define GPIO_PDOR_PDO28_SHIFT                    28                                                  /*!< FGPIOA_PDOR: PDO28 Position             */
#define GPIO_PDOR_PDO29_MASK                     (0x01UL << GPIO_PDOR_PDO29_SHIFT)                   /*!< FGPIOA_PDOR: PDO29 Mask                 */
#define GPIO_PDOR_PDO29_SHIFT                    29                                                  /*!< FGPIOA_PDOR: PDO29 Position             */
#define GPIO_PDOR_PDO30_MASK                     (0x01UL << GPIO_PDOR_PDO30_SHIFT)                   /*!< FGPIOA_PDOR: PDO30 Mask                 */
#define GPIO_PDOR_PDO30_SHIFT                    30                                                  /*!< FGPIOA_PDOR: PDO30 Position             */
#define GPIO_PDOR_PDO31_MASK                     (0x01UL << GPIO_PDOR_PDO31_SHIFT)                   /*!< FGPIOA_PDOR: PDO31 Mask                 */
#define GPIO_PDOR_PDO31_SHIFT                    31                                                  /*!< FGPIOA_PDOR: PDO31 Position             */

/* ------- FGPIOA_PSOR                              ------ */
#define GPIO_PSOR_PTSO0_MASK                     (0x01UL << GPIO_PSOR_PTSO0_SHIFT)                   /*!< FGPIOA_PSOR: PTSO0 Mask                 */
#define GPIO_PSOR_PTSO0_SHIFT                    0                                                   /*!< FGPIOA_PSOR: PTSO0 Position             */
#define GPIO_PSOR_PTSO1_MASK                     (0x01UL << GPIO_PSOR_PTSO1_SHIFT)                   /*!< FGPIOA_PSOR: PTSO1 Mask                 */
#define GPIO_PSOR_PTSO1_SHIFT                    1                                                   /*!< FGPIOA_PSOR: PTSO1 Position             */
#define GPIO_PSOR_PTSO2_MASK                     (0x01UL << GPIO_PSOR_PTSO2_SHIFT)                   /*!< FGPIOA_PSOR: PTSO2 Mask                 */
#define GPIO_PSOR_PTSO2_SHIFT                    2                                                   /*!< FGPIOA_PSOR: PTSO2 Position             */
#define GPIO_PSOR_PTSO3_MASK                     (0x01UL << GPIO_PSOR_PTSO3_SHIFT)                   /*!< FGPIOA_PSOR: PTSO3 Mask                 */
#define GPIO_PSOR_PTSO3_SHIFT                    3                                                   /*!< FGPIOA_PSOR: PTSO3 Position             */
#define GPIO_PSOR_PTSO4_MASK                     (0x01UL << GPIO_PSOR_PTSO4_SHIFT)                   /*!< FGPIOA_PSOR: PTSO4 Mask                 */
#define GPIO_PSOR_PTSO4_SHIFT                    4                                                   /*!< FGPIOA_PSOR: PTSO4 Position             */
#define GPIO_PSOR_PTSO5_MASK                     (0x01UL << GPIO_PSOR_PTSO5_SHIFT)                   /*!< FGPIOA_PSOR: PTSO5 Mask                 */
#define GPIO_PSOR_PTSO5_SHIFT                    5                                                   /*!< FGPIOA_PSOR: PTSO5 Position             */
#define GPIO_PSOR_PTSO6_MASK                     (0x01UL << GPIO_PSOR_PTSO6_SHIFT)                   /*!< FGPIOA_PSOR: PTSO6 Mask                 */
#define GPIO_PSOR_PTSO6_SHIFT                    6                                                   /*!< FGPIOA_PSOR: PTSO6 Position             */
#define GPIO_PSOR_PTSO7_MASK                     (0x01UL << GPIO_PSOR_PTSO7_SHIFT)                   /*!< FGPIOA_PSOR: PTSO7 Mask                 */
#define GPIO_PSOR_PTSO7_SHIFT                    7                                                   /*!< FGPIOA_PSOR: PTSO7 Position             */
#define GPIO_PSOR_PTSO8_MASK                     (0x01UL << GPIO_PSOR_PTSO8_SHIFT)                   /*!< FGPIOA_PSOR: PTSO8 Mask                 */
#define GPIO_PSOR_PTSO8_SHIFT                    8                                                   /*!< FGPIOA_PSOR: PTSO8 Position             */
#define GPIO_PSOR_PTSO9_MASK                     (0x01UL << GPIO_PSOR_PTSO9_SHIFT)                   /*!< FGPIOA_PSOR: PTSO9 Mask                 */
#define GPIO_PSOR_PTSO9_SHIFT                    9                                                   /*!< FGPIOA_PSOR: PTSO9 Position             */
#define GPIO_PSOR_PTSO10_MASK                    (0x01UL << GPIO_PSOR_PTSO10_SHIFT)                  /*!< FGPIOA_PSOR: PTSO10 Mask                */
#define GPIO_PSOR_PTSO10_SHIFT                   10                                                  /*!< FGPIOA_PSOR: PTSO10 Position            */
#define GPIO_PSOR_PTSO11_MASK                    (0x01UL << GPIO_PSOR_PTSO11_SHIFT)                  /*!< FGPIOA_PSOR: PTSO11 Mask                */
#define GPIO_PSOR_PTSO11_SHIFT                   11                                                  /*!< FGPIOA_PSOR: PTSO11 Position            */
#define GPIO_PSOR_PTSO12_MASK                    (0x01UL << GPIO_PSOR_PTSO12_SHIFT)                  /*!< FGPIOA_PSOR: PTSO12 Mask                */
#define GPIO_PSOR_PTSO12_SHIFT                   12                                                  /*!< FGPIOA_PSOR: PTSO12 Position            */
#define GPIO_PSOR_PTSO13_MASK                    (0x01UL << GPIO_PSOR_PTSO13_SHIFT)                  /*!< FGPIOA_PSOR: PTSO13 Mask                */
#define GPIO_PSOR_PTSO13_SHIFT                   13                                                  /*!< FGPIOA_PSOR: PTSO13 Position            */
#define GPIO_PSOR_PTSO14_MASK                    (0x01UL << GPIO_PSOR_PTSO14_SHIFT)                  /*!< FGPIOA_PSOR: PTSO14 Mask                */
#define GPIO_PSOR_PTSO14_SHIFT                   14                                                  /*!< FGPIOA_PSOR: PTSO14 Position            */
#define GPIO_PSOR_PTSO15_MASK                    (0x01UL << GPIO_PSOR_PTSO15_SHIFT)                  /*!< FGPIOA_PSOR: PTSO15 Mask                */
#define GPIO_PSOR_PTSO15_SHIFT                   15                                                  /*!< FGPIOA_PSOR: PTSO15 Position            */
#define GPIO_PSOR_PTSO16_MASK                    (0x01UL << GPIO_PSOR_PTSO16_SHIFT)                  /*!< FGPIOA_PSOR: PTSO16 Mask                */
#define GPIO_PSOR_PTSO16_SHIFT                   16                                                  /*!< FGPIOA_PSOR: PTSO16 Position            */
#define GPIO_PSOR_PTSO17_MASK                    (0x01UL << GPIO_PSOR_PTSO17_SHIFT)                  /*!< FGPIOA_PSOR: PTSO17 Mask                */
#define GPIO_PSOR_PTSO17_SHIFT                   17                                                  /*!< FGPIOA_PSOR: PTSO17 Position            */
#define GPIO_PSOR_PTSO18_MASK                    (0x01UL << GPIO_PSOR_PTSO18_SHIFT)                  /*!< FGPIOA_PSOR: PTSO18 Mask                */
#define GPIO_PSOR_PTSO18_SHIFT                   18                                                  /*!< FGPIOA_PSOR: PTSO18 Position            */
#define GPIO_PSOR_PTSO19_MASK                    (0x01UL << GPIO_PSOR_PTSO19_SHIFT)                  /*!< FGPIOA_PSOR: PTSO19 Mask                */
#define GPIO_PSOR_PTSO19_SHIFT                   19                                                  /*!< FGPIOA_PSOR: PTSO19 Position            */
#define GPIO_PSOR_PTSO20_MASK                    (0x01UL << GPIO_PSOR_PTSO20_SHIFT)                  /*!< FGPIOA_PSOR: PTSO20 Mask                */
#define GPIO_PSOR_PTSO20_SHIFT                   20                                                  /*!< FGPIOA_PSOR: PTSO20 Position            */
#define GPIO_PSOR_PTSO21_MASK                    (0x01UL << GPIO_PSOR_PTSO21_SHIFT)                  /*!< FGPIOA_PSOR: PTSO21 Mask                */
#define GPIO_PSOR_PTSO21_SHIFT                   21                                                  /*!< FGPIOA_PSOR: PTSO21 Position            */
#define GPIO_PSOR_PTSO22_MASK                    (0x01UL << GPIO_PSOR_PTSO22_SHIFT)                  /*!< FGPIOA_PSOR: PTSO22 Mask                */
#define GPIO_PSOR_PTSO22_SHIFT                   22                                                  /*!< FGPIOA_PSOR: PTSO22 Position            */
#define GPIO_PSOR_PTSO23_MASK                    (0x01UL << GPIO_PSOR_PTSO23_SHIFT)                  /*!< FGPIOA_PSOR: PTSO23 Mask                */
#define GPIO_PSOR_PTSO23_SHIFT                   23                                                  /*!< FGPIOA_PSOR: PTSO23 Position            */
#define GPIO_PSOR_PTSO24_MASK                    (0x01UL << GPIO_PSOR_PTSO24_SHIFT)                  /*!< FGPIOA_PSOR: PTSO24 Mask                */
#define GPIO_PSOR_PTSO24_SHIFT                   24                                                  /*!< FGPIOA_PSOR: PTSO24 Position            */
#define GPIO_PSOR_PTSO25_MASK                    (0x01UL << GPIO_PSOR_PTSO25_SHIFT)                  /*!< FGPIOA_PSOR: PTSO25 Mask                */
#define GPIO_PSOR_PTSO25_SHIFT                   25                                                  /*!< FGPIOA_PSOR: PTSO25 Position            */
#define GPIO_PSOR_PTSO26_MASK                    (0x01UL << GPIO_PSOR_PTSO26_SHIFT)                  /*!< FGPIOA_PSOR: PTSO26 Mask                */
#define GPIO_PSOR_PTSO26_SHIFT                   26                                                  /*!< FGPIOA_PSOR: PTSO26 Position            */
#define GPIO_PSOR_PTSO27_MASK                    (0x01UL << GPIO_PSOR_PTSO27_SHIFT)                  /*!< FGPIOA_PSOR: PTSO27 Mask                */
#define GPIO_PSOR_PTSO27_SHIFT                   27                                                  /*!< FGPIOA_PSOR: PTSO27 Position            */
#define GPIO_PSOR_PTSO28_MASK                    (0x01UL << GPIO_PSOR_PTSO28_SHIFT)                  /*!< FGPIOA_PSOR: PTSO28 Mask                */
#define GPIO_PSOR_PTSO28_SHIFT                   28                                                  /*!< FGPIOA_PSOR: PTSO28 Position            */
#define GPIO_PSOR_PTSO29_MASK                    (0x01UL << GPIO_PSOR_PTSO29_SHIFT)                  /*!< FGPIOA_PSOR: PTSO29 Mask                */
#define GPIO_PSOR_PTSO29_SHIFT                   29                                                  /*!< FGPIOA_PSOR: PTSO29 Position            */
#define GPIO_PSOR_PTSO30_MASK                    (0x01UL << GPIO_PSOR_PTSO30_SHIFT)                  /*!< FGPIOA_PSOR: PTSO30 Mask                */
#define GPIO_PSOR_PTSO30_SHIFT                   30                                                  /*!< FGPIOA_PSOR: PTSO30 Position            */
#define GPIO_PSOR_PTSO31_MASK                    (0x01UL << GPIO_PSOR_PTSO31_SHIFT)                  /*!< FGPIOA_PSOR: PTSO31 Mask                */
#define GPIO_PSOR_PTSO31_SHIFT                   31                                                  /*!< FGPIOA_PSOR: PTSO31 Position            */

