podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- FGPIOA_PCOR                              ------ */
#define GPIO_PCOR_PTCO0_MASK                     (0x01UL << GPIO_PCOR_PTCO0_SHIFT)                   /*!< FGPIOA_PCOR: PTCO0 Mask                 */
#define GPIO_PCOR_PTCO0_SHIFT                    0                                                   /*!< FGPIOA_PCOR: PTCO0 Position             */
#define GPIO_PCOR_PTCO1_MASK                     (0x01UL << GPIO_PCOR_PTCO1_SHIFT)                   /*!< FGPIOA_PCOR: PTCO1 Mask                 */
#define GPIO_PCOR_PTCO1_SHIFT                    1                                                   /*!< FGPIOA_PCOR: PTCO1 Position             */
#define GPIO_PCOR_PTCO2_MASK                     (0x01UL << GPIO_PCOR_PTCO2_SHIFT)                   /*!< FGPIOA_PCOR: PTCO2 Mask                 */
#define GPIO_PCOR_PTCO2_SHIFT                    2                                                   /*!< FGPIOA_PCOR: PTCO2 Position             */
#define GPIO_PCOR_PTCO3_MASK                     (0x01UL << GPIO_PCOR_PTCO3_SHIFT)                   /*!< FGPIOA_PCOR: PTCO3 Mask                 */
#define GPIO_PCOR_PTCO3_SHIFT                    3                                                   /*!< FGPIOA_PCOR: PTCO3 Position             */
#define GPIO_PCOR_PTCO4_MASK                     (0x01UL << GPIO_PCOR_PTCO4_SHIFT)                   /*!< FGPIOA_PCOR: PTCO4 Mask                 */
#define GPIO_PCOR_PTCO4_SHIFT                    4                                                   /*!< FGPIOA_PCOR: PTCO4 Position             */
#define GPIO_PCOR_PTCO5_MASK                     (0x01UL << GPIO_PCOR_PTCO5_SHIFT)                   /*!< FGPIOA_PCOR: PTCO5 Mask                 */
#define GPIO_PCOR_PTCO5_SHIFT                    5                                                   /*!< FGPIOA_PCOR: PTCO5 Position             */
#define GPIO_PCOR_PTCO6_MASK                     (0x01UL << GPIO_PCOR_PTCO6_SHIFT)                   /*!< FGPIOA_PCOR: PTCO6 Mask                 */
#define GPIO_PCOR_PTCO6_SHIFT                    6                                                   /*!< FGPIOA_PCOR: PTCO6 Position             */
#define GPIO_PCOR_PTCO7_MASK                     (0x01UL << GPIO_PCOR_PTCO7_SHIFT)                   /*!< FGPIOA_PCOR: PTCO7 Mask                 */
#define GPIO_PCOR_PTCO7_SHIFT                    7                                                   /*!< FGPIOA_PCOR: PTCO7 Position             */
#define GPIO_PCOR_PTCO8_MASK                     (0x01UL << GPIO_PCOR_PTCO8_SHIFT)                   /*!< FGPIOA_PCOR: PTCO8 Mask                 */
#define GPIO_PCOR_PTCO8_SHIFT                    8                                                   /*!< FGPIOA_PCOR: PTCO8 Position             */
#define GPIO_PCOR_PTCO9_MASK                     (0x01UL << GPIO_PCOR_PTCO9_SHIFT)                   /*!< FGPIOA_PCOR: PTCO9 Mask                 */
#define GPIO_PCOR_PTCO9_SHIFT                    9                                                   /*!< FGPIOA_PCOR: PTCO9 Position             */
#define GPIO_PCOR_PTCO10_MASK                    (0x01UL << GPIO_PCOR_PTCO10_SHIFT)                  /*!< FGPIOA_PCOR: PTCO10 Mask                */
#define GPIO_PCOR_PTCO10_SHIFT                   10                                                  /*!< FGPIOA_PCOR: PTCO10 Position            */
#define GPIO_PCOR_PTCO11_MASK                    (0x01UL << GPIO_PCOR_PTCO11_SHIFT)                  /*!< FGPIOA_PCOR: PTCO11 Mask                */
#define GPIO_PCOR_PTCO11_SHIFT                   11                                                  /*!< FGPIOA_PCOR: PTCO11 Position            */
#define GPIO_PCOR_PTCO12_MASK                    (0x01UL << GPIO_PCOR_PTCO12_SHIFT)                  /*!< FGPIOA_PCOR: PTCO12 Mask                */
#define GPIO_PCOR_PTCO12_SHIFT                   12                                                  /*!< FGPIOA_PCOR: PTCO12 Position            */
#define GPIO_PCOR_PTCO13_MASK                    (0x01UL << GPIO_PCOR_PTCO13_SHIFT)                  /*!< FGPIOA_PCOR: PTCO13 Mask                */
#define GPIO_PCOR_PTCO13_SHIFT                   13                                                  /*!< FGPIOA_PCOR: PTCO13 Position            */
#define GPIO_PCOR_PTCO14_MASK                    (0x01UL << GPIO_PCOR_PTCO14_SHIFT)                  /*!< FGPIOA_PCOR: PTCO14 Mask                */
#define GPIO_PCOR_PTCO14_SHIFT                   14                                                  /*!< FGPIOA_PCOR: PTCO14 Position            */
#define GPIO_PCOR_PTCO15_MASK                    (0x01UL << GPIO_PCOR_PTCO15_SHIFT)                  /*!< FGPIOA_PCOR: PTCO15 Mask                */
#define GPIO_PCOR_PTCO15_SHIFT                   15                                                  /*!< FGPIOA_PCOR: PTCO15 Position            */
#define GPIO_PCOR_PTCO16_MASK                    (0x01UL << GPIO_PCOR_PTCO16_SHIFT)                  /*!< FGPIOA_PCOR: PTCO16 Mask                */
#define GPIO_PCOR_PTCO16_SHIFT                   16                                                  /*!< FGPIOA_PCOR: PTCO16 Position            */
#define GPIO_PCOR_PTCO17_MASK                    (0x01UL << GPIO_PCOR_PTCO17_SHIFT)                  /*!< FGPIOA_PCOR: PTCO17 Mask                */
#define GPIO_PCOR_PTCO17_SHIFT                   17                                                  /*!< FGPIOA_PCOR: PTCO17 Position            */
#define GPIO_PCOR_PTCO18_MASK                    (0x01UL << GPIO_PCOR_PTCO18_SHIFT)                  /*!< FGPIOA_PCOR: PTCO18 Mask                */
#define GPIO_PCOR_PTCO18_SHIFT                   18                                                  /*!< FGPIOA_PCOR: PTCO18 Position            */
#define GPIO_PCOR_PTCO19_MASK                    (0x01UL << GPIO_PCOR_PTCO19_SHIFT)                  /*!< FGPIOA_PCOR: PTCO19 Mask                */
#define GPIO_PCOR_PTCO19_SHIFT                   19                                                  /*!< FGPIOA_PCOR: PTCO19 Position            */
#define GPIO_PCOR_PTCO20_MASK                    (0x01UL << GPIO_PCOR_PTCO20_SHIFT)                  /*!< FGPIOA_PCOR: PTCO20 Mask                */
#define GPIO_PCOR_PTCO20_SHIFT                   20                                                  /*!< FGPIOA_PCOR: PTCO20 Position            */
#define GPIO_PCOR_PTCO21_MASK                    (0x01UL << GPIO_PCOR_PTCO21_SHIFT)                  /*!< FGPIOA_PCOR: PTCO21 Mask                */
#define GPIO_PCOR_PTCO21_SHIFT                   21                                                  /*!< FGPIOA_PCOR: PTCO21 Position            */
#define GPIO_PCOR_PTCO22_MASK                    (0x01UL << GPIO_PCOR_PTCO22_SHIFT)                  /*!< FGPIOA_PCOR: PTCO22 Mask                */
#define GPIO_PCOR_PTCO22_SHIFT                   22                                                  /*!< FGPIOA_PCOR: PTCO22 Position            */
#define GPIO_PCOR_PTCO23_MASK                    (0x01UL << GPIO_PCOR_PTCO23_SHIFT)                  /*!< FGPIOA_PCOR: PTCO23 Mask                */
#define GPIO_PCOR_PTCO23_SHIFT                   23                                                  /*!< FGPIOA_PCOR: PTCO23 Position            */
#define GPIO_PCOR_PTCO24_MASK                    (0x01UL << GPIO_PCOR_PTCO24_SHIFT)                  /*!< FGPIOA_PCOR: PTCO24 Mask                */
#define GPIO_PCOR_PTCO24_SHIFT                   24                                                  /*!< FGPIOA_PCOR: PTCO24 Position            */
#define GPIO_PCOR_PTCO25_MASK                    (0x01UL << GPIO_PCOR_PTCO25_SHIFT)                  /*!< FGPIOA_PCOR: PTCO25 Mask                */
#define GPIO_PCOR_PTCO25_SHIFT                   25                                                  /*!< FGPIOA_PCOR: PTCO25 Position            */
#define GPIO_PCOR_PTCO26_MASK                    (0x01UL << GPIO_PCOR_PTCO26_SHIFT)                  /*!< FGPIOA_PCOR: PTCO26 Mask                */
#define GPIO_PCOR_PTCO26_SHIFT                   26                                                  /*!< FGPIOA_PCOR: PTCO26 Position            */
#define GPIO_PCOR_PTCO27_MASK                    (0x01UL << GPIO_PCOR_PTCO27_SHIFT)                  /*!< FGPIOA_PCOR: PTCO27 Mask                */
#define GPIO_PCOR_PTCO27_SHIFT                   27                                                  /*!< FGPIOA_PCOR: PTCO27 Position            */
#define GPIO_PCOR_PTCO28_MASK                    (0x01UL << GPIO_PCOR_PTCO28_SHIFT)                  /*!< FGPIOA_PCOR: PTCO28 Mask                */
#define GPIO_PCOR_PTCO28_SHIFT                   28                                                  /*!< FGPIOA_PCOR: PTCO28 Position            */
#define GPIO_PCOR_PTCO29_MASK                    (0x01UL << GPIO_PCOR_PTCO29_SHIFT)                  /*!< FGPIOA_PCOR: PTCO29 Mask                */
#define GPIO_PCOR_PTCO29_SHIFT                   29                                                  /*!< FGPIOA_PCOR: PTCO29 Position            */
#define GPIO_PCOR_PTCO30_MASK                    (0x01UL << GPIO_PCOR_PTCO30_SHIFT)                  /*!< FGPIOA_PCOR: PTCO30 Mask                */
#define GPIO_PCOR_PTCO30_SHIFT                   30                                                  /*!< FGPIOA_PCOR: PTCO30 Position            */
#define GPIO_PCOR_PTCO31_MASK                    (0x01UL << GPIO_PCOR_PTCO31_SHIFT)                  /*!< FGPIOA_PCOR: PTCO31 Mask                */
#define GPIO_PCOR_PTCO31_SHIFT                   31                                                  /*!< FGPIOA_PCOR: PTCO31 Position            */

/* ------- FGPIOA_PTOR                              ------ */
#define GPIO_PTOR_PTTO0_MASK                     (0x01UL << GPIO_PTOR_PTTO0_SHIFT)                   /*!< FGPIOA_PTOR: PTTO0 Mask                 */
#define GPIO_PTOR_PTTO0_SHIFT                    0                                                   /*!< FGPIOA_PTOR: PTTO0 Position             */
#define GPIO_PTOR_PTTO1_MASK                     (0x01UL << GPIO_PTOR_PTTO1_SHIFT)                   /*!< FGPIOA_PTOR: PTTO1 Mask                 */
#define GPIO_PTOR_PTTO1_SHIFT                    1                                                   /*!< FGPIOA_PTOR: PTTO1 Position             */
#define GPIO_PTOR_PTTO2_MASK                     (0x01UL << GPIO_PTOR_PTTO2_SHIFT)                   /*!< FGPIOA_PTOR: PTTO2 Mask                 */
#define GPIO_PTOR_PTTO2_SHIFT                    2                                                   /*!< FGPIOA_PTOR: PTTO2 Position             */
#define GPIO_PTOR_PTTO3_MASK                     (0x01UL << GPIO_PTOR_PTTO3_SHIFT)                   /*!< FGPIOA_PTOR: PTTO3 Mask                 */
#define GPIO_PTOR_PTTO3_SHIFT                    3                                                   /*!< FGPIOA_PTOR: PTTO3 Position             */
#define GPIO_PTOR_PTTO4_MASK                     (0x01UL << GPIO_PTOR_PTTO4_SHIFT)                   /*!< FGPIOA_PTOR: PTTO4 Mask                 */
#define GPIO_PTOR_PTTO4_SHIFT                    4                                                   /*!< FGPIOA_PTOR: PTTO4 Position             */
#define GPIO_PTOR_PTTO5_MASK                     (0x01UL << GPIO_PTOR_PTTO5_SHIFT)                   /*!< FGPIOA_PTOR: PTTO5 Mask                 */
#define GPIO_PTOR_PTTO5_SHIFT                    5                                                   /*!< FGPIOA_PTOR: PTTO5 Position             */
#define GPIO_PTOR_PTTO6_MASK                     (0x01UL << GPIO_PTOR_PTTO6_SHIFT)                   /*!< FGPIOA_PTOR: PTTO6 Mask                 */
#define GPIO_PTOR_PTTO6_SHIFT                    6                                                   /*!< FGPIOA_PTOR: PTTO6 Position             */
#define GPIO_PTOR_PTTO7_MASK                     (0x01UL << GPIO_PTOR_PTTO7_SHIFT)                   /*!< FGPIOA_PTOR: PTTO7 Mask                 */
#define GPIO_PTOR_PTTO7_SHIFT                    7                                                   /*!< FGPIOA_PTOR: PTTO7 Position             */
#define GPIO_PTOR_PTTO8_MASK                     (0x01UL << GPIO_PTOR_PTTO8_SHIFT)                   /*!< FGPIOA_PTOR: PTTO8 Mask                 */
#define GPIO_PTOR_PTTO8_SHIFT                    8                                                   /*!< FGPIOA_PTOR: PTTO8 Position             */
#define GPIO_PTOR_PTTO9_MASK                     (0x01UL << GPIO_PTOR_PTTO9_SHIFT)                   /*!< FGPIOA_PTOR: PTTO9 Mask                 */
#define GPIO_PTOR_PTTO9_SHIFT                    9                                                   /*!< FGPIOA_PTOR: PTTO9 Position             */
#define GPIO_PTOR_PTTO10_MASK                    (0x01UL << GPIO_PTOR_PTTO10_SHIFT)                  /*!< FGPIOA_PTOR: PTTO10 Mask                */
#define GPIO_PTOR_PTTO10_SHIFT                   10                                                  /*!< FGPIOA_PTOR: PTTO10 Position            */
#define GPIO_PTOR_PTTO11_MASK                    (0x01UL << GPIO_PTOR_PTTO11_SHIFT)                  /*!< FGPIOA_PTOR: PTTO11 Mask                */
#define GPIO_PTOR_PTTO11_SHIFT                   11                                                  /*!< FGPIOA_PTOR: PTTO11 Position            */
#define GPIO_PTOR_PTTO12_MASK                    (0x01UL << GPIO_PTOR_PTTO12_SHIFT)                  /*!< FGPIOA_PTOR: PTTO12 Mask                */
#define GPIO_PTOR_PTTO12_SHIFT                   12                                                  /*!< FGPIOA_PTOR: PTTO12 Position            */
#define GPIO_PTOR_PTTO13_MASK                    (0x01UL << GPIO_PTOR_PTTO13_SHIFT)                  /*!< FGPIOA_PTOR: PTTO13 Mask                */
#define GPIO_PTOR_PTTO13_SHIFT                   13                                                  /*!< FGPIOA_PTOR: PTTO13 Position            */
#define GPIO_PTOR_PTTO14_MASK                    (0x01UL << GPIO_PTOR_PTTO14_SHIFT)                  /*!< FGPIOA_PTOR: PTTO14 Mask                */
#define GPIO_PTOR_PTTO14_SHIFT                   14                                                  /*!< FGPIOA_PTOR: PTTO14 Position            */
#define GPIO_PTOR_PTTO15_MASK                    (0x01UL << GPIO_PTOR_PTTO15_SHIFT)                  /*!< FGPIOA_PTOR: PTTO15 Mask                */
#define GPIO_PTOR_PTTO15_SHIFT                   15                                                  /*!< FGPIOA_PTOR: PTTO15 Position            */
#define GPIO_PTOR_PTTO16_MASK                    (0x01UL << GPIO_PTOR_PTTO16_SHIFT)                  /*!< FGPIOA_PTOR: PTTO16 Mask                */
#define GPIO_PTOR_PTTO16_SHIFT                   16                                                  /*!< FGPIOA_PTOR: PTTO16 Position            */
#define GPIO_PTOR_PTTO17_MASK                    (0x01UL << GPIO_PTOR_PTTO17_SHIFT)                  /*!< FGPIOA_PTOR: PTTO17 Mask                */
#define GPIO_PTOR_PTTO17_SHIFT                   17                                                  /*!< FGPIOA_PTOR: PTTO17 Position            */
#define GPIO_PTOR_PTTO18_MASK                    (0x01UL << GPIO_PTOR_PTTO18_SHIFT)                  /*!< FGPIOA_PTOR: PTTO18 Mask                */
#define GPIO_PTOR_PTTO18_SHIFT                   18                                                  /*!< FGPIOA_PTOR: PTTO18 Position            */
#define GPIO_PTOR_PTTO19_MASK                    (0x01UL << GPIO_PTOR_PTTO19_SHIFT)                  /*!< FGPIOA_PTOR: PTTO19 Mask                */
#define GPIO_PTOR_PTTO19_SHIFT                   19                                                  /*!< FGPIOA_PTOR: PTTO19 Position            */
#define GPIO_PTOR_PTTO20_MASK                    (0x01UL << GPIO_PTOR_PTTO20_SHIFT)                  /*!< FGPIOA_PTOR: PTTO20 Mask                */
#define GPIO_PTOR_PTTO20_SHIFT                   20                                                  /*!< FGPIOA_PTOR: PTTO20 Position            */
#define GPIO_PTOR_PTTO21_MASK                    (0x01UL << GPIO_PTOR_PTTO21_SHIFT)                  /*!< FGPIOA_PTOR: PTTO21 Mask                */
#define GPIO_PTOR_PTTO21_SHIFT                   21                                                  /*!< FGPIOA_PTOR: PTTO21 Position            */
#define GPIO_PTOR_PTTO22_MASK                    (0x01UL << GPIO_PTOR_PTTO22_SHIFT)                  /*!< FGPIOA_PTOR: PTTO22 Mask                */
#define GPIO_PTOR_PTTO22_SHIFT                   22                                                  /*!< FGPIOA_PTOR: PTTO22 Position            */
#define GPIO_PTOR_PTTO23_MASK                    (0x01UL << GPIO_PTOR_PTTO23_SHIFT)                  /*!< FGPIOA_PTOR: PTTO23 Mask                */
#define GPIO_PTOR_PTTO23_SHIFT                   23                                                  /*!< FGPIOA_PTOR: PTTO23 Position            */
#define GPIO_PTOR_PTTO24_MASK                    (0x01UL << GPIO_PTOR_PTTO24_SHIFT)                  /*!< FGPIOA_PTOR: PTTO24 Mask                */
#define GPIO_PTOR_PTTO24_SHIFT                   24                                                  /*!< FGPIOA_PTOR: PTTO24 Position            */
#define GPIO_PTOR_PTTO25_MASK                    (0x01UL << GPIO_PTOR_PTTO25_SHIFT)                  /*!< FGPIOA_PTOR: PTTO25 Mask                */
#define GPIO_PTOR_PTTO25_SHIFT                   25                                                  /*!< FGPIOA_PTOR: PTTO25 Position            */
#define GPIO_PTOR_PTTO26_MASK                    (0x01UL << GPIO_PTOR_PTTO26_SHIFT)                  /*!< FGPIOA_PTOR: PTTO26 Mask                */
#define GPIO_PTOR_PTTO26_SHIFT                   26                                                  /*!< FGPIOA_PTOR: PTTO26 Position            */
#define GPIO_PTOR_PTTO27_MASK                    (0x01UL << GPIO_PTOR_PTTO27_SHIFT)                  /*!< FGPIOA_PTOR: PTTO27 Mask                */
#define GPIO_PTOR_PTTO27_SHIFT                   27                                                  /*!< FGPIOA_PTOR: PTTO27 Position            */
#define GPIO_PTOR_PTTO28_MASK                    (0x01UL << GPIO_PTOR_PTTO28_SHIFT)                  /*!< FGPIOA_PTOR: PTTO28 Mask                */
#define GPIO_PTOR_PTTO28_SHIFT                   28                                                  /*!< FGPIOA_PTOR: PTTO28 Position            */
#define GPIO_PTOR_PTTO29_MASK                    (0x01UL << GPIO_PTOR_PTTO29_SHIFT)                  /*!< FGPIOA_PTOR: PTTO29 Mask                */
#define GPIO_PTOR_PTTO29_SHIFT                   29                                                  /*!< FGPIOA_PTOR: PTTO29 Position            */
#define GPIO_PTOR_PTTO30_MASK                    (0x01UL << GPIO_PTOR_PTTO30_SHIFT)                  /*!< FGPIOA_PTOR: PTTO30 Mask                */
#define GPIO_PTOR_PTTO30_SHIFT                   30                                                  /*!< FGPIOA_PTOR: PTTO30 Position            */
#define GPIO_PTOR_PTTO31_MASK                    (0x01UL << GPIO_PTOR_PTTO31_SHIFT)                  /*!< FGPIOA_PTOR: PTTO31 Mask                */
#define GPIO_PTOR_PTTO31_SHIFT                   31                                                  /*!< FGPIOA_PTOR: PTTO31 Position            */

