podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- FGPIOA_PDIR                              ------ */
#define GPIO_PDIR_PDI0_MASK                      (0x01UL << GPIO_PDIR_PDI0_SHIFT)                    /*!< FGPIOA_PDIR: PDI0 Mask                  */
#define GPIO_PDIR_PDI0_SHIFT                     0                                                   /*!< FGPIOA_PDIR: PDI0 Position              */
#define GPIO_PDIR_PDI1_MASK                      (0x01UL << GPIO_PDIR_PDI1_SHIFT)                    /*!< FGPIOA_PDIR: PDI1 Mask                  */
#define GPIO_PDIR_PDI1_SHIFT                     1                                                   /*!< FGPIOA_PDIR: PDI1 Position              */
#define GPIO_PDIR_PDI2_MASK                      (0x01UL << GPIO_PDIR_PDI2_SHIFT)                    /*!< FGPIOA_PDIR: PDI2 Mask                  */
#define GPIO_PDIR_PDI2_SHIFT                     2                                                   /*!< FGPIOA_PDIR: PDI2 Position              */
#define GPIO_PDIR_PDI3_MASK                      (0x01UL << GPIO_PDIR_PDI3_SHIFT)                    /*!< FGPIOA_PDIR: PDI3 Mask                  */
#define GPIO_PDIR_PDI3_SHIFT                     3                                                   /*!< FGPIOA_PDIR: PDI3 Position              */
#define GPIO_PDIR_PDI4_MASK                      (0x01UL << GPIO_PDIR_PDI4_SHIFT)                    /*!< FGPIOA_PDIR: PDI4 Mask                  */
#define GPIO_PDIR_PDI4_SHIFT                     4                                                   /*!< FGPIOA_PDIR: PDI4 Position              */
#define GPIO_PDIR_PDI5_MASK                      (0x01UL << GPIO_PDIR_PDI5_SHIFT)                    /*!< FGPIOA_PDIR: PDI5 Mask                  */
#define GPIO_PDIR_PDI5_SHIFT                     5                                                   /*!< FGPIOA_PDIR: PDI5 Position              */
#define GPIO_PDIR_PDI6_MASK                      (0x01UL << GPIO_PDIR_PDI6_SHIFT)                    /*!< FGPIOA_PDIR: PDI6 Mask                  */
#define GPIO_PDIR_PDI6_SHIFT                     6                                                   /*!< FGPIOA_PDIR: PDI6 Position              */
#define GPIO_PDIR_PDI7_MASK                      (0x01UL << GPIO_PDIR_PDI7_SHIFT)                    /*!< FGPIOA_PDIR: PDI7 Mask                  */
#define GPIO_PDIR_PDI7_SHIFT                     7                                                   /*!< FGPIOA_PDIR: PDI7 Position              */
#define GPIO_PDIR_PDI8_MASK                      (0x01UL << GPIO_PDIR_PDI8_SHIFT)                    /*!< FGPIOA_PDIR: PDI8 Mask                  */
#define GPIO_PDIR_PDI8_SHIFT                     8                                                   /*!< FGPIOA_PDIR: PDI8 Position              */
#define GPIO_PDIR_PDI9_MASK                      (0x01UL << GPIO_PDIR_PDI9_SHIFT)                    /*!< FGPIOA_PDIR: PDI9 Mask                  */
#define GPIO_PDIR_PDI9_SHIFT                     9                                                   /*!< FGPIOA_PDIR: PDI9 Position              */
#define GPIO_PDIR_PDI10_MASK                     (0x01UL << GPIO_PDIR_PDI10_SHIFT)                   /*!< FGPIOA_PDIR: PDI10 Mask                 */
#define GPIO_PDIR_PDI10_SHIFT                    10                                                  /*!< FGPIOA_PDIR: PDI10 Position             */
#define GPIO_PDIR_PDI11_MASK                     (0x01UL << GPIO_PDIR_PDI11_SHIFT)                   /*!< FGPIOA_PDIR: PDI11 Mask                 */
#define GPIO_PDIR_PDI11_SHIFT                    11                                                  /*!< FGPIOA_PDIR: PDI11 Position             */
#define GPIO_PDIR_PDI12_MASK                     (0x01UL << GPIO_PDIR_PDI12_SHIFT)                   /*!< FGPIOA_PDIR: PDI12 Mask                 */
#define GPIO_PDIR_PDI12_SHIFT                    12                                                  /*!< FGPIOA_PDIR: PDI12 Position             */
#define GPIO_PDIR_PDI13_MASK                     (0x01UL << GPIO_PDIR_PDI13_SHIFT)                   /*!< FGPIOA_PDIR: PDI13 Mask                 */
#define GPIO_PDIR_PDI13_SHIFT                    13                                                  /*!< FGPIOA_PDIR: PDI13 Position             */
#define GPIO_PDIR_PDI14_MASK                     (0x01UL << GPIO_PDIR_PDI14_SHIFT)                   /*!< FGPIOA_PDIR: PDI14 Mask                 */
#define GPIO_PDIR_PDI14_SHIFT                    14                                                  /*!< FGPIOA_PDIR: PDI14 Position             */
#define GPIO_PDIR_PDI15_MASK                     (0x01UL << GPIO_PDIR_PDI15_SHIFT)                   /*!< FGPIOA_PDIR: PDI15 Mask                 */
#define GPIO_PDIR_PDI15_SHIFT                    15                                                  /*!< FGPIOA_PDIR: PDI15 Position             */
#define GPIO_PDIR_PDI16_MASK                     (0x01UL << GPIO_PDIR_PDI16_SHIFT)                   /*!< FGPIOA_PDIR: PDI16 Mask                 */
#define GPIO_PDIR_PDI16_SHIFT                    16                                                  /*!< FGPIOA_PDIR: PDI16 Position             */
#define GPIO_PDIR_PDI17_MASK                     (0x01UL << GPIO_PDIR_PDI17_SHIFT)                   /*!< FGPIOA_PDIR: PDI17 Mask                 */
#define GPIO_PDIR_PDI17_SHIFT                    17                                                  /*!< FGPIOA_PDIR: PDI17 Position             */
#define GPIO_PDIR_PDI18_MASK                     (0x01UL << GPIO_PDIR_PDI18_SHIFT)                   /*!< FGPIOA_PDIR: PDI18 Mask                 */
#define GPIO_PDIR_PDI18_SHIFT                    18                                                  /*!< FGPIOA_PDIR: PDI18 Position             */
#define GPIO_PDIR_PDI19_MASK                     (0x01UL << GPIO_PDIR_PDI19_SHIFT)                   /*!< FGPIOA_PDIR: PDI19 Mask                 */
#define GPIO_PDIR_PDI19_SHIFT                    19                                                  /*!< FGPIOA_PDIR: PDI19 Position             */
#define GPIO_PDIR_PDI20_MASK                     (0x01UL << GPIO_PDIR_PDI20_SHIFT)                   /*!< FGPIOA_PDIR: PDI20 Mask                 */
#define GPIO_PDIR_PDI20_SHIFT                    20                                                  /*!< FGPIOA_PDIR: PDI20 Position             */
#define GPIO_PDIR_PDI21_MASK                     (0x01UL << GPIO_PDIR_PDI21_SHIFT)                   /*!< FGPIOA_PDIR: PDI21 Mask                 */
#define GPIO_PDIR_PDI21_SHIFT                    21                                                  /*!< FGPIOA_PDIR: PDI21 Position             */
#define GPIO_PDIR_PDI22_MASK                     (0x01UL << GPIO_PDIR_PDI22_SHIFT)                   /*!< FGPIOA_PDIR: PDI22 Mask                 */
#define GPIO_PDIR_PDI22_SHIFT                    22                                                  /*!< FGPIOA_PDIR: PDI22 Position             */
#define GPIO_PDIR_PDI23_MASK                     (0x01UL << GPIO_PDIR_PDI23_SHIFT)                   /*!< FGPIOA_PDIR: PDI23 Mask                 */
#define GPIO_PDIR_PDI23_SHIFT                    23                                                  /*!< FGPIOA_PDIR: PDI23 Position             */
#define GPIO_PDIR_PDI24_MASK                     (0x01UL << GPIO_PDIR_PDI24_SHIFT)                   /*!< FGPIOA_PDIR: PDI24 Mask                 */
#define GPIO_PDIR_PDI24_SHIFT                    24                                                  /*!< FGPIOA_PDIR: PDI24 Position             */
#define GPIO_PDIR_PDI25_MASK                     (0x01UL << GPIO_PDIR_PDI25_SHIFT)                   /*!< FGPIOA_PDIR: PDI25 Mask                 */
#define GPIO_PDIR_PDI25_SHIFT                    25                                                  /*!< FGPIOA_PDIR: PDI25 Position             */
#define GPIO_PDIR_PDI26_MASK                     (0x01UL << GPIO_PDIR_PDI26_SHIFT)                   /*!< FGPIOA_PDIR: PDI26 Mask                 */
#define GPIO_PDIR_PDI26_SHIFT                    26                                                  /*!< FGPIOA_PDIR: PDI26 Position             */
#define GPIO_PDIR_PDI27_MASK                     (0x01UL << GPIO_PDIR_PDI27_SHIFT)                   /*!< FGPIOA_PDIR: PDI27 Mask                 */
#define GPIO_PDIR_PDI27_SHIFT                    27                                                  /*!< FGPIOA_PDIR: PDI27 Position             */
#define GPIO_PDIR_PDI28_MASK                     (0x01UL << GPIO_PDIR_PDI28_SHIFT)                   /*!< FGPIOA_PDIR: PDI28 Mask                 */
#define GPIO_PDIR_PDI28_SHIFT                    28                                                  /*!< FGPIOA_PDIR: PDI28 Position             */
#define GPIO_PDIR_PDI29_MASK                     (0x01UL << GPIO_PDIR_PDI29_SHIFT)                   /*!< FGPIOA_PDIR: PDI29 Mask                 */
#define GPIO_PDIR_PDI29_SHIFT                    29                                                  /*!< FGPIOA_PDIR: PDI29 Position             */
#define GPIO_PDIR_PDI30_MASK                     (0x01UL << GPIO_PDIR_PDI30_SHIFT)                   /*!< FGPIOA_PDIR: PDI30 Mask                 */
#define GPIO_PDIR_PDI30_SHIFT                    30                                                  /*!< FGPIOA_PDIR: PDI30 Position             */
#define GPIO_PDIR_PDI31_MASK                     (0x01UL << GPIO_PDIR_PDI31_SHIFT)                   /*!< FGPIOA_PDIR: PDI31 Mask                 */
#define GPIO_PDIR_PDI31_SHIFT                    31                                                  /*!< FGPIOA_PDIR: PDI31 Position             */

/* ------- FGPIOA_PDDR                              ------ */
#define GPIO_PDDR_PDD0_MASK                      (0x01UL << GPIO_PDDR_PDD0_SHIFT)                    /*!< FGPIOA_PDDR: PDD0 Mask                  */
#define GPIO_PDDR_PDD0_SHIFT                     0                                                   /*!< FGPIOA_PDDR: PDD0 Position              */
#define GPIO_PDDR_PDD1_MASK                      (0x01UL << GPIO_PDDR_PDD1_SHIFT)                    /*!< FGPIOA_PDDR: PDD1 Mask                  */
#define GPIO_PDDR_PDD1_SHIFT                     1                                                   /*!< FGPIOA_PDDR: PDD1 Position              */
#define GPIO_PDDR_PDD2_MASK                      (0x01UL << GPIO_PDDR_PDD2_SHIFT)                    /*!< FGPIOA_PDDR: PDD2 Mask                  */
#define GPIO_PDDR_PDD2_SHIFT                     2                                                   /*!< FGPIOA_PDDR: PDD2 Position              */
#define GPIO_PDDR_PDD3_MASK                      (0x01UL << GPIO_PDDR_PDD3_SHIFT)                    /*!< FGPIOA_PDDR: PDD3 Mask                  */
#define GPIO_PDDR_PDD3_SHIFT                     3                                                   /*!< FGPIOA_PDDR: PDD3 Position              */
#define GPIO_PDDR_PDD4_MASK                      (0x01UL << GPIO_PDDR_PDD4_SHIFT)                    /*!< FGPIOA_PDDR: PDD4 Mask                  */
#define GPIO_PDDR_PDD4_SHIFT                     4                                                   /*!< FGPIOA_PDDR: PDD4 Position              */
#define GPIO_PDDR_PDD5_MASK                      (0x01UL << GPIO_PDDR_PDD5_SHIFT)                    /*!< FGPIOA_PDDR: PDD5 Mask                  */
#define GPIO_PDDR_PDD5_SHIFT                     5                                                   /*!< FGPIOA_PDDR: PDD5 Position              */
#define GPIO_PDDR_PDD6_MASK                      (0x01UL << GPIO_PDDR_PDD6_SHIFT)                    /*!< FGPIOA_PDDR: PDD6 Mask                  */
#define GPIO_PDDR_PDD6_SHIFT                     6                                                   /*!< FGPIOA_PDDR: PDD6 Position              */
#define GPIO_PDDR_PDD7_MASK                      (0x01UL << GPIO_PDDR_PDD7_SHIFT)                    /*!< FGPIOA_PDDR: PDD7 Mask                  */
#define GPIO_PDDR_PDD7_SHIFT                     7                                                   /*!< FGPIOA_PDDR: PDD7 Position              */
#define GPIO_PDDR_PDD8_MASK                      (0x01UL << GPIO_PDDR_PDD8_SHIFT)                    /*!< FGPIOA_PDDR: PDD8 Mask                  */
#define GPIO_PDDR_PDD8_SHIFT                     8                                                   /*!< FGPIOA_PDDR: PDD8 Position              */
#define GPIO_PDDR_PDD9_MASK                      (0x01UL << GPIO_PDDR_PDD9_SHIFT)                    /*!< FGPIOA_PDDR: PDD9 Mask                  */
#define GPIO_PDDR_PDD9_SHIFT                     9                                                   /*!< FGPIOA_PDDR: PDD9 Position              */
#define GPIO_PDDR_PDD10_MASK                     (0x01UL << GPIO_PDDR_PDD10_SHIFT)                   /*!< FGPIOA_PDDR: PDD10 Mask                 */
#define GPIO_PDDR_PDD10_SHIFT                    10                                                  /*!< FGPIOA_PDDR: PDD10 Position             */
#define GPIO_PDDR_PDD11_MASK                     (0x01UL << GPIO_PDDR_PDD11_SHIFT)                   /*!< FGPIOA_PDDR: PDD11 Mask                 */
#define GPIO_PDDR_PDD11_SHIFT                    11                                                  /*!< FGPIOA_PDDR: PDD11 Position             */
#define GPIO_PDDR_PDD12_MASK                     (0x01UL << GPIO_PDDR_PDD12_SHIFT)                   /*!< FGPIOA_PDDR: PDD12 Mask                 */
#define GPIO_PDDR_PDD12_SHIFT                    12                                                  /*!< FGPIOA_PDDR: PDD12 Position             */
#define GPIO_PDDR_PDD13_MASK                     (0x01UL << GPIO_PDDR_PDD13_SHIFT)                   /*!< FGPIOA_PDDR: PDD13 Mask                 */
#define GPIO_PDDR_PDD13_SHIFT                    13                                                  /*!< FGPIOA_PDDR: PDD13 Position             */
#define GPIO_PDDR_PDD14_MASK                     (0x01UL << GPIO_PDDR_PDD14_SHIFT)                   /*!< FGPIOA_PDDR: PDD14 Mask                 */
#define GPIO_PDDR_PDD14_SHIFT                    14                                                  /*!< FGPIOA_PDDR: PDD14 Position             */
#define GPIO_PDDR_PDD15_MASK                     (0x01UL << GPIO_PDDR_PDD15_SHIFT)                   /*!< FGPIOA_PDDR: PDD15 Mask                 */
#define GPIO_PDDR_PDD15_SHIFT                    15                                                  /*!< FGPIOA_PDDR: PDD15 Position             */
#define GPIO_PDDR_PDD16_MASK                     (0x01UL << GPIO_PDDR_PDD16_SHIFT)                   /*!< FGPIOA_PDDR: PDD16 Mask                 */
#define GPIO_PDDR_PDD16_SHIFT                    16                                                  /*!< FGPIOA_PDDR: PDD16 Position             */
#define GPIO_PDDR_PDD17_MASK                     (0x01UL << GPIO_PDDR_PDD17_SHIFT)                   /*!< FGPIOA_PDDR: PDD17 Mask                 */
#define GPIO_PDDR_PDD17_SHIFT                    17                                                  /*!< FGPIOA_PDDR: PDD17 Position             */
#define GPIO_PDDR_PDD18_MASK                     (0x01UL << GPIO_PDDR_PDD18_SHIFT)                   /*!< FGPIOA_PDDR: PDD18 Mask                 */
#define GPIO_PDDR_PDD18_SHIFT                    18                                                  /*!< FGPIOA_PDDR: PDD18 Position             */
#define GPIO_PDDR_PDD19_MASK                     (0x01UL << GPIO_PDDR_PDD19_SHIFT)                   /*!< FGPIOA_PDDR: PDD19 Mask                 */
#define GPIO_PDDR_PDD19_SHIFT                    19                                                  /*!< FGPIOA_PDDR: PDD19 Position             */
#define GPIO_PDDR_PDD20_MASK                     (0x01UL << GPIO_PDDR_PDD20_SHIFT)                   /*!< FGPIOA_PDDR: PDD20 Mask                 */
#define GPIO_PDDR_PDD20_SHIFT                    20                                                  /*!< FGPIOA_PDDR: PDD20 Position             */
#define GPIO_PDDR_PDD21_MASK                     (0x01UL << GPIO_PDDR_PDD21_SHIFT)                   /*!< FGPIOA_PDDR: PDD21 Mask                 */
#define GPIO_PDDR_PDD21_SHIFT                    21                                                  /*!< FGPIOA_PDDR: PDD21 Position             */
#define GPIO_PDDR_PDD22_MASK                     (0x01UL << GPIO_PDDR_PDD22_SHIFT)                   /*!< FGPIOA_PDDR: PDD22 Mask                 */
#define GPIO_PDDR_PDD22_SHIFT                    22                                                  /*!< FGPIOA_PDDR: PDD22 Position             */
#define GPIO_PDDR_PDD23_MASK                     (0x01UL << GPIO_PDDR_PDD23_SHIFT)                   /*!< FGPIOA_PDDR: PDD23 Mask                 */
#define GPIO_PDDR_PDD23_SHIFT                    23                                                  /*!< FGPIOA_PDDR: PDD23 Position             */
#define GPIO_PDDR_PDD24_MASK                     (0x01UL << GPIO_PDDR_PDD24_SHIFT)                   /*!< FGPIOA_PDDR: PDD24 Mask                 */
#define GPIO_PDDR_PDD24_SHIFT                    24                                                  /*!< FGPIOA_PDDR: PDD24 Position             */
#define GPIO_PDDR_PDD25_MASK                     (0x01UL << GPIO_PDDR_PDD25_SHIFT)                   /*!< FGPIOA_PDDR: PDD25 Mask                 */
#define GPIO_PDDR_PDD25_SHIFT                    25                                                  /*!< FGPIOA_PDDR: PDD25 Position             */
#define GPIO_PDDR_PDD26_MASK                     (0x01UL << GPIO_PDDR_PDD26_SHIFT)                   /*!< FGPIOA_PDDR: PDD26 Mask                 */
#define GPIO_PDDR_PDD26_SHIFT                    26                                                  /*!< FGPIOA_PDDR: PDD26 Position             */
#define GPIO_PDDR_PDD27_MASK                     (0x01UL << GPIO_PDDR_PDD27_SHIFT)                   /*!< FGPIOA_PDDR: PDD27 Mask                 */
#define GPIO_PDDR_PDD27_SHIFT                    27                                                  /*!< FGPIOA_PDDR: PDD27 Position             */
#define GPIO_PDDR_PDD28_MASK                     (0x01UL << GPIO_PDDR_PDD28_SHIFT)                   /*!< FGPIOA_PDDR: PDD28 Mask                 */
#define GPIO_PDDR_PDD28_SHIFT                    28                                                  /*!< FGPIOA_PDDR: PDD28 Position             */
#define GPIO_PDDR_PDD29_MASK                     (0x01UL << GPIO_PDDR_PDD29_SHIFT)                   /*!< FGPIOA_PDDR: PDD29 Mask                 */
#define GPIO_PDDR_PDD29_SHIFT                    29                                                  /*!< FGPIOA_PDDR: PDD29 Position             */
#define GPIO_PDDR_PDD30_MASK                     (0x01UL << GPIO_PDDR_PDD30_SHIFT)                   /*!< FGPIOA_PDDR: PDD30 Mask                 */
#define GPIO_PDDR_PDD30_SHIFT                    30                                                  /*!< FGPIOA_PDDR: PDD30 Position             */
#define GPIO_PDDR_PDD31_MASK                     (0x01UL << GPIO_PDDR_PDD31_SHIFT)                   /*!< FGPIOA_PDDR: PDD31 Mask                 */
#define GPIO_PDDR_PDD31_SHIFT                    31                                                  /*!< FGPIOA_PDDR: PDD31 Position             */

/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOA' Register Access macros                      ----------- */
/* -------------------------------------------------------------------------------- */

#define FGPIOA_PDOR                    (FGPIOA->PDOR)
#define FGPIOA_PSOR                    (FGPIOA->PSOR)
#define FGPIOA_PCOR                    (FGPIOA->PCOR)
#define FGPIOA_PTOR                    (FGPIOA->PTOR)
#define FGPIOA_PDIR                    (FGPIOA->PDIR)
#define FGPIOA_PDDR                    (FGPIOA->PDDR)

/* ================================================================================ */
/* ================           FGPIOB (derived from FGPIOA)         ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef FGPIOA_Type FGPIOB_Type;  /*!< FGPIOB Structure                                            */


/* -------------------------------------------------------------------------------- */
/* -----------     'FGPIOB' Register Access macros                      ----------- */
/* -------------------------------------------------------------------------------- */

