podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- TPM0_CONF                                ------ */
#define TPM_CONF_DOZEEN_MASK                     (0x01UL << TPM_CONF_DOZEEN_SHIFT)                   /*!< TPM0_CONF: DOZEEN Mask                  */
#define TPM_CONF_DOZEEN_SHIFT                    5                                                   /*!< TPM0_CONF: DOZEEN Position              */
#define TPM_CONF_DBGMODE_MASK                    (0x03UL << TPM_CONF_DBGMODE_SHIFT)                  /*!< TPM0_CONF: DBGMODE Mask                 */
#define TPM_CONF_DBGMODE_SHIFT                   6                                                   /*!< TPM0_CONF: DBGMODE Position             */
#define TPM_CONF_DBGMODE(x)                      (((x)<<TPM_CONF_DBGMODE_SHIFT)&TPM_CONF_DBGMODE_MASK) /*!< TPM0_CONF                               */
#define TPM_CONF_GTBEEN_MASK                     (0x01UL << TPM_CONF_GTBEEN_SHIFT)                   /*!< TPM0_CONF: GTBEEN Mask                  */
#define TPM_CONF_GTBEEN_SHIFT                    9                                                   /*!< TPM0_CONF: GTBEEN Position              */
#define TPM_CONF_CSOT_MASK                       (0x01UL << TPM_CONF_CSOT_SHIFT)                     /*!< TPM0_CONF: CSOT Mask                    */
#define TPM_CONF_CSOT_SHIFT                      16                                                  /*!< TPM0_CONF: CSOT Position                */
#define TPM_CONF_CSOO_MASK                       (0x01UL << TPM_CONF_CSOO_SHIFT)                     /*!< TPM0_CONF: CSOO Mask                    */
#define TPM_CONF_CSOO_SHIFT                      17                                                  /*!< TPM0_CONF: CSOO Position                */
#define TPM_CONF_CROT_MASK                       (0x01UL << TPM_CONF_CROT_SHIFT)                     /*!< TPM0_CONF: CROT Mask                    */
#define TPM_CONF_CROT_SHIFT                      18                                                  /*!< TPM0_CONF: CROT Position                */
#define TPM_CONF_TRGSEL_MASK                     (0x0FUL << TPM_CONF_TRGSEL_SHIFT)                   /*!< TPM0_CONF: TRGSEL Mask                  */
#define TPM_CONF_TRGSEL_SHIFT                    24                                                  /*!< TPM0_CONF: TRGSEL Position              */
#define TPM_CONF_TRGSEL(x)                       (((x)<<TPM_CONF_TRGSEL_SHIFT)&TPM_CONF_TRGSEL_MASK) /*!< TPM0_CONF                               */

/* -------------------------------------------------------------------------------- */
/* -----------     'TPM0' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define TPM0_SC                        (TPM0->SC)
#define TPM0_CNT                       (TPM0->CNT)
#define TPM0_MOD                       (TPM0->MOD)
#define TPM0_C0SC                      (TPM0->CONTROLS[0].CnSC)
#define TPM0_C0V                       (TPM0->CONTROLS[0].CnV)
#define TPM0_C1SC                      (TPM0->CONTROLS[1].CnSC)
#define TPM0_C1V                       (TPM0->CONTROLS[1].CnV)
#define TPM0_C2SC                      (TPM0->CONTROLS[2].CnSC)
#define TPM0_C2V                       (TPM0->CONTROLS[2].CnV)
#define TPM0_C3SC                      (TPM0->CONTROLS[3].CnSC)
#define TPM0_C3V                       (TPM0->CONTROLS[3].CnV)
#define TPM0_C4SC                      (TPM0->CONTROLS[4].CnSC)
#define TPM0_C4V                       (TPM0->CONTROLS[4].CnV)
#define TPM0_C5SC                      (TPM0->CONTROLS[5].CnSC)
#define TPM0_C5V                       (TPM0->CONTROLS[5].CnV)
#define TPM0_STATUS                    (TPM0->STATUS)
#define TPM0_CONF                      (TPM0->CONF)

/* ================================================================================ */
/* ================           TPM1 (file:TPM1_2CH)                 ================ */
/* ================================================================================ */

/**
 * @brief Timer/PWM Module (2 channels)
 */
typedef struct {                                /*!<       TPM1 Structure                                               */
   __IO uint32_t  SC;                           /*!< 0000: Status and Control                                           */
   __IO uint32_t  CNT;                          /*!< 0004: Counter                                                      */
   __IO uint32_t  MOD;                          /*!< 0008: Modulo                                                       */
   struct { /* (cluster) */                     /*!< 000C: (size=0x0010, 16)                                            */
      __IO uint32_t  CnSC;                      /*!< 000C: Channel  Status and Control                                  */
      __IO uint32_t  CnV;                       /*!< 0010: Channel  Value                                               */
   } CONTROLS[2];
   __I  uint32_t  RESERVED0[13];                /*!< 001C:                                                              */
   __IO uint32_t  STATUS;                       /*!< 0050: Capture and Compare Status                                   */
   __I  uint32_t  RESERVED1[12];                /*!< 0054:                                                              */
   __IO uint32_t  CONF;                         /*!< 0084: Configuration                                                */
} TPM1_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'TPM1' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- TPM1_SC                                  ------ */

/* ------- TPM1_CNT                                 ------ */

/* ------- TPM1_MOD                                 ------ */

/* ------- TPM1_CnSC                                ------ */

/* ------- TPM1_CnV                                 ------ */

