podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- TPM1_STATUS                              ------ */

/* ------- TPM1_CONF                                ------ */

/* -------------------------------------------------------------------------------- */
/* -----------     'TPM1' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define TPM1_SC                        (TPM1->SC)
#define TPM1_CNT                       (TPM1->CNT)
#define TPM1_MOD                       (TPM1->MOD)
#define TPM1_C0SC                      (TPM1->CONTROLS[0].CnSC)
#define TPM1_C0V                       (TPM1->CONTROLS[0].CnV)
#define TPM1_C1SC                      (TPM1->CONTROLS[1].CnSC)
#define TPM1_C1V                       (TPM1->CONTROLS[1].CnV)
#define TPM1_STATUS                    (TPM1->STATUS)
#define TPM1_CONF                      (TPM1->CONF)

/* ================================================================================ */
/* ================           TPM2 (derived from TPM1)             ================ */
/* ================================================================================ */

/**
 * @brief Timer/PWM Module (2 channels)
 */
typedef TPM1_Type TPM2_Type;  /*!< TPM2 Structure                                              */


/* -------------------------------------------------------------------------------- */
/* -----------     'TPM2' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define TPM2_SC                        (TPM2->SC)
#define TPM2_CNT                       (TPM2->CNT)
#define TPM2_MOD                       (TPM2->MOD)
#define TPM2_C0SC                      (TPM2->CONTROLS[0].CnSC)
#define TPM2_C0V                       (TPM2->CONTROLS[0].CnV)
#define TPM2_C1SC                      (TPM2->CONTROLS[1].CnSC)
#define TPM2_C1V                       (TPM2->CONTROLS[1].CnV)
#define TPM2_STATUS                    (TPM2->STATUS)
#define TPM2_CONF                      (TPM2->CONF)

/* ================================================================================ */
/* ================           TSI0 (file:TSI0_MKL)                 ================ */
/* ================================================================================ */

/**
 * @brief Touch Sensing Input
 */
typedef struct {                                /*!<       TSI0 Structure                                               */
   __IO uint32_t  GENCS;                        /*!< 0000: TSI General Control and Status Register                      */
   __IO uint32_t  DATA;                         /*!< 0004: TSI DATA Register                                            */
   __IO uint32_t  TSHD;                         /*!< 0008: TSI Threshold Register                                       */
} TSI0_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'TSI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- TSI0_GENCS                               ------ */
#define TSI_GENCS_CURSW_MASK                     (0x01UL << TSI_GENCS_CURSW_SHIFT)                   /*!< TSI0_GENCS: CURSW Mask                  */
#define TSI_GENCS_CURSW_SHIFT                    1                                                   /*!< TSI0_GENCS: CURSW Position              */
#define TSI_GENCS_EOSF_MASK                      (0x01UL << TSI_GENCS_EOSF_SHIFT)                    /*!< TSI0_GENCS: EOSF Mask                   */
#define TSI_GENCS_EOSF_SHIFT                     2                                                   /*!< TSI0_GENCS: EOSF Position               */
#define TSI_GENCS_SCNIP_MASK                     (0x01UL << TSI_GENCS_SCNIP_SHIFT)                   /*!< TSI0_GENCS: SCNIP Mask                  */
#define TSI_GENCS_SCNIP_SHIFT                    3                                                   /*!< TSI0_GENCS: SCNIP Position              */
#define TSI_GENCS_STM_MASK                       (0x01UL << TSI_GENCS_STM_SHIFT)                     /*!< TSI0_GENCS: STM Mask                    */
#define TSI_GENCS_STM_SHIFT                      4                                                   /*!< TSI0_GENCS: STM Position                */
#define TSI_GENCS_STPE_MASK                      (0x01UL << TSI_GENCS_STPE_SHIFT)                    /*!< TSI0_GENCS: STPE Mask                   */
#define TSI_GENCS_STPE_SHIFT                     5                                                   /*!< TSI0_GENCS: STPE Position               */
#define TSI_GENCS_TSIIEN_MASK                    (0x01UL << TSI_GENCS_TSIIEN_SHIFT)                  /*!< TSI0_GENCS: TSIIEN Mask                 */
#define TSI_GENCS_TSIIEN_SHIFT                   6                                                   /*!< TSI0_GENCS: TSIIEN Position             */
#define TSI_GENCS_TSIEN_MASK                     (0x01UL << TSI_GENCS_TSIEN_SHIFT)                   /*!< TSI0_GENCS: TSIEN Mask                  */
#define TSI_GENCS_TSIEN_SHIFT                    7                                                   /*!< TSI0_GENCS: TSIEN Position              */
#define TSI_GENCS_NSCN_MASK                      (0x1FUL << TSI_GENCS_NSCN_SHIFT)                    /*!< TSI0_GENCS: NSCN Mask                   */
#define TSI_GENCS_NSCN_SHIFT                     8                                                   /*!< TSI0_GENCS: NSCN Position               */
#define TSI_GENCS_NSCN(x)                        (((x)<<TSI_GENCS_NSCN_SHIFT)&TSI_GENCS_NSCN_MASK)   /*!< TSI0_GENCS                              */
#define TSI_GENCS_PS_MASK                        (0x07UL << TSI_GENCS_PS_SHIFT)                      /*!< TSI0_GENCS: PS Mask                     */
#define TSI_GENCS_PS_SHIFT                       13                                                  /*!< TSI0_GENCS: PS Position                 */
#define TSI_GENCS_PS(x)                          (((x)<<TSI_GENCS_PS_SHIFT)&TSI_GENCS_PS_MASK)       /*!< TSI0_GENCS                              */
#define TSI_GENCS_EXTCHRG_MASK                   (0x07UL << TSI_GENCS_EXTCHRG_SHIFT)                 /*!< TSI0_GENCS: EXTCHRG Mask                */
#define TSI_GENCS_EXTCHRG_SHIFT                  16                                                  /*!< TSI0_GENCS: EXTCHRG Position            */
#define TSI_GENCS_EXTCHRG(x)                     (((x)<<TSI_GENCS_EXTCHRG_SHIFT)&TSI_GENCS_EXTCHRG_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_DVOLT_MASK                     (0x03UL << TSI_GENCS_DVOLT_SHIFT)                   /*!< TSI0_GENCS: DVOLT Mask                  */
#define TSI_GENCS_DVOLT_SHIFT                    19                                                  /*!< TSI0_GENCS: DVOLT Position              */
#define TSI_GENCS_DVOLT(x)                       (((x)<<TSI_GENCS_DVOLT_SHIFT)&TSI_GENCS_DVOLT_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_REFCHRG_MASK                   (0x07UL << TSI_GENCS_REFCHRG_SHIFT)                 /*!< TSI0_GENCS: REFCHRG Mask                */
#define TSI_GENCS_REFCHRG_SHIFT                  21                                                  /*!< TSI0_GENCS: REFCHRG Position            */
#define TSI_GENCS_REFCHRG(x)                     (((x)<<TSI_GENCS_REFCHRG_SHIFT)&TSI_GENCS_REFCHRG_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_MODE_MASK                      (0x0FUL << TSI_GENCS_MODE_SHIFT)                    /*!< TSI0_GENCS: MODE Mask                   */
#define TSI_GENCS_MODE_SHIFT                     24                                                  /*!< TSI0_GENCS: MODE Position               */
#define TSI_GENCS_MODE(x)                        (((x)<<TSI_GENCS_MODE_SHIFT)&TSI_GENCS_MODE_MASK)   /*!< TSI0_GENCS                              */
#define TSI_GENCS_ESOR_MASK                      (0x01UL << TSI_GENCS_ESOR_SHIFT)                    /*!< TSI0_GENCS: ESOR Mask                   */
#define TSI_GENCS_ESOR_SHIFT                     28                                                  /*!< TSI0_GENCS: ESOR Position               */
#define TSI_GENCS_OUTRGF_MASK                    (0x01UL << TSI_GENCS_OUTRGF_SHIFT)                  /*!< TSI0_GENCS: OUTRGF Mask                 */
#define TSI_GENCS_OUTRGF_SHIFT                   31                                                  /*!< TSI0_GENCS: OUTRGF Position             */

