podonoghue/usbdm-firmware/BootloopMKL/Project_Headers/MKL25Z128M4.h
/* ------- TSI0_DATA                                ------ */
#define TSI_DATA_TSICNT_MASK                     (0xFFFFUL << TSI_DATA_TSICNT_SHIFT)                 /*!< TSI0_DATA: TSICNT Mask                  */
#define TSI_DATA_TSICNT_SHIFT                    0                                                   /*!< TSI0_DATA: TSICNT Position              */
#define TSI_DATA_TSICNT(x)                       (((x)<<TSI_DATA_TSICNT_SHIFT)&TSI_DATA_TSICNT_MASK) /*!< TSI0_DATA                               */
#define TSI_DATA_SWTS_MASK                       (0x01UL << TSI_DATA_SWTS_SHIFT)                     /*!< TSI0_DATA: SWTS Mask                    */
#define TSI_DATA_SWTS_SHIFT                      22                                                  /*!< TSI0_DATA: SWTS Position                */
#define TSI_DATA_DMAEN_MASK                      (0x01UL << TSI_DATA_DMAEN_SHIFT)                    /*!< TSI0_DATA: DMAEN Mask                   */
#define TSI_DATA_DMAEN_SHIFT                     23                                                  /*!< TSI0_DATA: DMAEN Position               */
#define TSI_DATA_TSICH_MASK                      (0x0FUL << TSI_DATA_TSICH_SHIFT)                    /*!< TSI0_DATA: TSICH Mask                   */
#define TSI_DATA_TSICH_SHIFT                     28                                                  /*!< TSI0_DATA: TSICH Position               */
#define TSI_DATA_TSICH(x)                        (((x)<<TSI_DATA_TSICH_SHIFT)&TSI_DATA_TSICH_MASK)   /*!< TSI0_DATA                               */

/* ------- TSI0_TSHD                                ------ */
#define TSI_TSHD_THRESL_MASK                     (0xFFFFUL << TSI_TSHD_THRESL_SHIFT)                 /*!< TSI0_TSHD: THRESL Mask                  */
#define TSI_TSHD_THRESL_SHIFT                    0                                                   /*!< TSI0_TSHD: THRESL Position              */
#define TSI_TSHD_THRESL(x)                       (((x)<<TSI_TSHD_THRESL_SHIFT)&TSI_TSHD_THRESL_MASK) /*!< TSI0_TSHD                               */
#define TSI_TSHD_THRESH_MASK                     (0xFFFFUL << TSI_TSHD_THRESH_SHIFT)                 /*!< TSI0_TSHD: THRESH Mask                  */
#define TSI_TSHD_THRESH_SHIFT                    16                                                  /*!< TSI0_TSHD: THRESH Position              */
#define TSI_TSHD_THRESH(x)                       (((x)<<TSI_TSHD_THRESH_SHIFT)&TSI_TSHD_THRESH_MASK) /*!< TSI0_TSHD                               */

/* -------------------------------------------------------------------------------- */
/* -----------     'TSI0' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define TSI0_GENCS                     (TSI0->GENCS)
#define TSI0_DATA                      (TSI0->DATA)
#define TSI0_TSHD                      (TSI0->TSHD)

/* ================================================================================ */
/* ================           UART0 (file:UART0_MKL)               ================ */
/* ================================================================================ */

/**
 * @brief Universal Asynchronous Receiver/Transmitter
 */
typedef struct {                                /*!<       UART0 Structure                                              */
   __IO uint8_t   BDH;                          /*!< 0000: Baud Rate Register: High                                     */
   __IO uint8_t   BDL;                          /*!< 0001: Baud Rate Register: Low                                      */
   __IO uint8_t   C1;                           /*!< 0002: Control Register 1                                           */
   __IO uint8_t   C2;                           /*!< 0003: Control Register 2                                           */
   __IO uint8_t   S1;                           /*!< 0004: Status Register 1                                            */
   __IO uint8_t   S2;                           /*!< 0005: Status Register 2                                            */
   __IO uint8_t   C3;                           /*!< 0006: Control Register 3                                           */
   __IO uint8_t   D;                            /*!< 0007: Data Register                                                */
   __IO uint8_t   MA1;                          /*!< 0008: Match Address Registers 1                                    */
   __IO uint8_t   MA2;                          /*!< 0009: Match Address Registers 2                                    */
   __IO uint8_t   C4;                           /*!< 000A: Control Register 4                                           */
   __IO uint8_t   C5;                           /*!< 000B: Control Register 5                                           */
} UART0_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'UART0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- UART0_BDH                                ------ */
#define UART_BDH_SBR_MASK                        (0x1FUL << UART_BDH_SBR_SHIFT)                      /*!< UART0_BDH: SBR Mask                     */
#define UART_BDH_SBR_SHIFT                       0                                                   /*!< UART0_BDH: SBR Position                 */
#define UART_BDH_SBR(x)                          (((x)<<UART_BDH_SBR_SHIFT)&UART_BDH_SBR_MASK)       /*!< UART0_BDH                               */
#define UART_BDH_SBNS_MASK                       (0x01UL << UART_BDH_SBNS_SHIFT)                     /*!< UART0_BDH: SBNS Mask                    */
#define UART_BDH_SBNS_SHIFT                      5                                                   /*!< UART0_BDH: SBNS Position                */
#define UART_BDH_RXEDGIE_MASK                    (0x01UL << UART_BDH_RXEDGIE_SHIFT)                  /*!< UART0_BDH: RXEDGIE Mask                 */
#define UART_BDH_RXEDGIE_SHIFT                   6                                                   /*!< UART0_BDH: RXEDGIE Position             */
#define UART_BDH_LBKDIE_MASK                     (0x01UL << UART_BDH_LBKDIE_SHIFT)                   /*!< UART0_BDH: LBKDIE Mask                  */
#define UART_BDH_LBKDIE_SHIFT                    7                                                   /*!< UART0_BDH: LBKDIE Position              */

/* ------- UART0_BDL                                ------ */
#define UART_BDL_SBR_MASK                        (0xFFUL << UART_BDL_SBR_SHIFT)                      /*!< UART0_BDL: SBR Mask                     */
#define UART_BDL_SBR_SHIFT                       0                                                   /*!< UART0_BDL: SBR Position                 */
#define UART_BDL_SBR(x)                          (((x)<<UART_BDL_SBR_SHIFT)&UART_BDL_SBR_MASK)       /*!< UART0_BDL                               */

/* ------- UART0_C1                                 ------ */
#define UART_C1_PT_MASK                          (0x01UL << UART_C1_PT_SHIFT)                        /*!< UART0_C1: PT Mask                       */
#define UART_C1_PT_SHIFT                         0                                                   /*!< UART0_C1: PT Position                   */
#define UART_C1_PE_MASK                          (0x01UL << UART_C1_PE_SHIFT)                        /*!< UART0_C1: PE Mask                       */
#define UART_C1_PE_SHIFT                         1                                                   /*!< UART0_C1: PE Position                   */
#define UART_C1_ILT_MASK                         (0x01UL << UART_C1_ILT_SHIFT)                       /*!< UART0_C1: ILT Mask                      */
#define UART_C1_ILT_SHIFT                        2                                                   /*!< UART0_C1: ILT Position                  */
#define UART_C1_WAKE_MASK                        (0x01UL << UART_C1_WAKE_SHIFT)                      /*!< UART0_C1: WAKE Mask                     */
#define UART_C1_WAKE_SHIFT                       3                                                   /*!< UART0_C1: WAKE Position                 */
#define UART_C1_M_MASK                           (0x01UL << UART_C1_M_SHIFT)                         /*!< UART0_C1: M Mask                        */
#define UART_C1_M_SHIFT                          4                                                   /*!< UART0_C1: M Position                    */
#define UART_C1_RSRC_MASK                        (0x01UL << UART_C1_RSRC_SHIFT)                      /*!< UART0_C1: RSRC Mask                     */
#define UART_C1_RSRC_SHIFT                       5                                                   /*!< UART0_C1: RSRC Position                 */
#define UART_C1_DOZEEN_MASK                      (0x01UL << UART_C1_DOZEEN_SHIFT)                    /*!< UART0_C1: DOZEEN Mask                   */
#define UART_C1_DOZEEN_SHIFT                     6                                                   /*!< UART0_C1: DOZEEN Position               */
#define UART_C1_LOOPS_MASK                       (0x01UL << UART_C1_LOOPS_SHIFT)                     /*!< UART0_C1: LOOPS Mask                    */
#define UART_C1_LOOPS_SHIFT                      7                                                   /*!< UART0_C1: LOOPS Position                */

